
public class seminar_001 {
    public static void main(String[] args) {
        // Написать программу, которая запросит пользователя ввести
        // <Имя> в консоли.
        // Получит введенную строку и выведет в консоль сообщение
        // “Привет, <Имя>!”
        
        System.out.println("Enter your name:  ");
        String name = scanner_class_string.scanner_class_string();
        System.out.printf("Hello, %s!", name);
    }
}
